labs/car-listings/app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars"
---
  def index
    @cars = Car.all

INSERT INTO "cars" ("model", "year", "description", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["model", "t"], ["year", "2019"], ["description", "dsfsdf"], ["color", "yellow"], ["created_at", "2019-09-26 17:48:00.480389"], ["updated_at", "2019-09-26 17:48:00.480389"]]
---
  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save

SELECT  "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_car
      @car = Car.find(params[:id])